IDEA Open Model
ConcreteCheckResultOverallItem.ResultType Property
Compatible with IDEA StatiCa v 10.1
 Check result type
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public CheckResultType ResultType { get; set; }
Public Property ResultType As CheckResultType
	Get
	Set
public:
property CheckResultType ResultType {
	CheckResultType get ();
	void set (CheckResultType value);
}
Property Value
Type: CheckResultType
See Also
Reference
ConcreteCheckResultOverallItem Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace